{
  "Inicio": "Home",
  "Acerca de mi": "About",
  "Servicios": "Services",
  "Proyectos": "Projects",
  "Contacto": "Contact",
  "Iniciar Sesión": "Login",
  "Registrarse": "Register",
  "Cerrar Sesión": "Logout",
  "Panel": "Dashboard",
  "Bienvenido": "Welcome",
  "Español": "Spanish",
  "Inglés": "English",
  "Desarrollador FullStack": "FullStack Developer",
  "experiencia_texto": "Over 5 years of experience developing robust and scalable web applications. I specialize in technologies like PHP, JavaScript, Laravel, Yii2, Vue.js and React.js, as well as database management with MySQL, PostgreSQL and implementation of solutions with WordPress and Drupal.",
  "Acerca de mí": "About Me",
  "Currículum": "Resume",
  "desarrollo web": "web development",
  "Desarrollo Web": "Web Development",
  "desarrollo_web_desc": "I design and develop websites and web applications tailored to your needs.",
  "Plataformas": "Platforms",
  "plataformas_desc": "I design, structure and develop custom platforms for your business.",
  "Ecommerce": "Ecommerce",
  "ecommerce_desc": "I boost your sales potential through e-Commerce with payment gateway integration.",
  "cms": "cms",
  "CMS": "CMS",
  "cms_desc": "I develop fast sites with WordPress and Drupal, applying different security techniques.",
  "diseño web": "web design",
  "Diseño Web Efectivo": "Effective Web Design",
  "diseno_web_desc": "I create effective web design that makes an impact on your brand.",
  "Consultoria": "Consulting",
  "Consultoría UX/UI": "UX/UI Consulting",
  "consultoria_desc": "I design and create the interface your company needs, secure and easy to use.",
  "Portafolio": "Portfolio",
  "visitar_texto": "You can also visit the",
  "proyectos_texto": "website where you'll find more projects I've collaborated on as a web developer.",
  "Ver sitio web": "View website",
  "minestle_desc": "Site with articles, recipes, promotions and podcasts filtered by country.",
  "nescafe_desc": "Website development for the special edition Nescafé Huehuetenango.",
  "crypto_desc": "Landing page with countdown for crypto currency exhibition event in Dubai.",
  "No disponible": "Not available",
  "chappsy_desc": "Website development with instant e-commerce activation.",
  "viajegt_desc": "Directory of associated companies and blog for the Sustainable Tourism Commission of Agexport.",
  "agexport_desc": "Multisite development of Exportable Offer for the sectors of Agexport Guatemala.",
  "checklist_desc": "Platform to maintain a checklist of toy collections.",
  "medicenter_desc": "Self-manageable website with news blog.",
  "Foto de perfil": "Profile photo",
  "acerca_descripcion_1": "I am a passionate developer with over 5 years of experience creating robust and scalable web applications. I specialize in technologies like PHP, JavaScript, Laravel, Yii2, Vue.js and React.js, as well as database management with MySQL, PostgreSQL and implementation of solutions with WordPress and Drupal.",
  "acerca_descripcion_2": "I enjoy the challenge of exploring and mastering new technologies to constantly expand my skills. I love setting challenging goals to push myself and find creative solutions to obstacles, committing to contribute my best effort in every project.",
  "Habilidades Técnicas": "Technical Skills",
  "Frontend": "Frontend",
  "Diseño Responsivo": "Responsive Design",
  "Diseño Atómico": "Atomic Design",
  "Backend & Bases de Datos": "Backend & Databases",
  "CMS & Plataformas": "CMS & Platforms",
  "Herramientas & Metodologías": "Tools & Methodologies",
  "Optimización": "Optimization",
  "Mantenibilidad": "Maintainability",
  "Soporte en Producción": "Production Support",
  "Experiencia Profesional": "Professional Experience",
  "Programador Full Stack": "Full Stack Developer",
  "ia2030_summary": "Responsible for creating and maintaining a central administration platform for a systems company in the gaming and lottery sector, ensuring system reliability, security and usability for internal users.",
  "ia2030_resp_1_title": "Development and Maintenance of Features:",
  "ia2030_resp_1_desc": "I designed, implemented and maintained critical features for multiple web projects, ensuring system scalability and stability. This included dynamic configuration of products and draws, and creation of reusable components to optimize workflow.",
  "ia2030_resp_2_title": "Optimization and Performance:",
  "ia2030_resp_2_desc": "I optimized code architecture, reducing complexity and improving maintainability for future developments. This resulted in significant improvement in application performance.",
  "ia2030_resp_3_title": "Module Leadership:",
  "ia2030_resp_3_desc": "I led the creation of critical modules for the administration platform, managing the project from initial requirements to production deployment. This included close collaboration with back-end and design teams.",
  "ia2030_resp_4_title": "Production Support and Debugging:",
  "ia2030_resp_4_desc": "I provided level 3 production support, responding to incidents and debugging failures in real time to ensure service continuity and customer satisfaction.",
  "ia2030_resp_5_title": "Database Management:",
  "ia2030_resp_5_desc": "I collaborated on optimizing database queries for editing entities and products, avoiding performance issues and timeouts.",
  "Tecnologías principales utilizadas": "Main technologies used",
  "Desarrollador Web Senior": "Senior Web Developer",
  "weclick_senior_resp_1": "I led the complete development cycle for web applications and digital marketing campaigns for major international clients in Central America and Uruguay.",
  "weclick_senior_resp_2": "I collaborated in multidisciplinary teams following agile methodologies to deliver projects within established deadlines.",
  "weclick_senior_resp_3": "I implemented technical solutions that processed transactions and managed user data securely and efficiently.",
  "Proyectos Destacados": "Featured Projects",
  "proyecto_borges_title": "Promotions System - Borges Central America",
  "proyecto_borges_desc_1": "I developed a complete promotions management system for food products",
  "proyecto_borges_desc_2": "I implemented administration modules, participant validation and report generation",
  "proyecto_borges_desc_3": "I optimized performance to handle traffic peaks during promotional campaigns",
  "proyecto_coors_title": "Points Redemption System - Coors Light Central America",
  "proyecto_coors_desc_1": "I created a loyalty platform where users redeemed points for prizes",
  "proyecto_coors_desc_2": "I integrated with coupon systems and point-of-sale validation",
  "proyecto_coors_desc_3": "I designed the database architecture for transaction and points tracking",
  "proyecto_agexport_title": "Information Window - Agexport Guatemala",
  "proyecto_agexport_desc_1": "I developed an information management system for exporters",
  "proyecto_agexport_desc_2": "I implemented administrative panels and content categorization modules",
  "proyecto_purina_title": "Recommendation System - Purina Central America",
  "proyecto_purina_desc_1": "I created an interactive system to recommend pet names based on characteristics",
  "proyecto_purina_desc_2": "I implemented a matching algorithm that improved user experience",
  "Algoritmos": "Algorithms",
  "proyecto_minestle_title": "Minestle Site - Nestlé Central America",
  "proyecto_minestle_desc_1": "I developed and customized a corporate site using Drupal",
  "proyecto_minestle_desc_2": "I implemented custom modules and optimized site performance",
  "proyecto_ebeauty_title": "Ebeauty Uruguay and Beauty Zone Campaigns",
  "proyecto_ebeauty_desc_1": "I developed multiple promotion platforms and product offers for the Uruguayan and Central American market",
  "proyecto_ebeauty_desc_2": "I implemented registration, validation and participant tracking systems",
  "proyecto_ebeauty_desc_3": "I created administration panels for real-time campaign monitoring",
  "proyecto_nestle_title": "Landing Pages and Preference Centers - Nestlé Central America",
  "proyecto_nestle_desc_1": "I developed landing pages for specific Nescafé product campaigns",
  "proyecto_nestle_desc_2": "I implemented preference centers for audience segmentation and personalized marketing",
  "proyecto_nestle_desc_3": "I optimized sites for maximum performance and conversion",
  "Desarrollador Web": "Web Developer",
  "weclick_junior_resp_1": "I participated in the development of custom web applications for various clients, mainly in Guatemala.",
  "weclick_junior_resp_2": "I contributed to the complete development cycle from requirements analysis to implementation.",
  "weclick_junior_resp_3": "I maintained and optimized existing systems improving their functionality and performance.",
  "proyecto_harley_title": "Billing System - Harley Guatemala",
  "proyecto_harley_desc_1": "I developed a billing registration and customer requirements management system",
  "proyecto_harley_desc_2": "I implemented report generation modules and status tracking",
  "proyecto_harley_desc_3": "I automated manual processes improving operational efficiency",
  "proyecto_escuela_title": "Registration System - La Asunción School Guatemala",
  "proyecto_escuela_desc_1": "I created a complete online registration platform for students",
  "proyecto_escuela_desc_2": "I implemented data validations and approval flows",
  "proyecto_escuela_desc_3": "I designed a user-friendly interface for users with different access levels",
  "proyecto_vupe_title": "Informative Sites - VUPE Guatemala and Agexport Guatemala",
  "proyecto_vupe_desc_1": "I developed informative websites with WordPress",
  "proyecto_vupe_desc_2": "I customized themes and plugins according to each client's specific requirements",
  "proyecto_vupe_desc_3": "I optimized SEO and user experience in all projects"
}