{
  "Inicio": "Inicio",
  "Acerca de mi": "Acerca de mi",
  "Servicios": "Servicios",
  "Proyectos": "Proyectos",
  "Contacto": "Contacto",
  "Iniciar Sesión": "Iniciar Sesión",
  "Registrarse": "Registrarse",
  "Cerrar Sesión": "Cerrar Sesión",
  "Panel": "Panel",
  "Bienvenido": "Bienvenido",
  "Español": "Español",
  "Inglés": "Inglés",
  "Desarrollador FullStack": "Desarrollador FullStack",
  "experiencia_texto": "Más de 5 años de experiencia en el desarrollo de aplicaciones web robustas y escalables. Me especializo en tecnologías como PHP, JavaScript, Laravel, Yii2, Vue.js y React.js, así como en la gestión de bases de datos con MySQL, PostgreSQL y la implementación de soluciones con WordPress y Drupal.",
  "Acerca de mí": "Acerca de mí",
  "Currículum": "Currículum",
  "desarrollo web": "desarrollo web",
  "Desarrollo Web": "Desarrollo Web",
  "desarrollo_web_desc": "Diseño y desarrollo sitios y aplicaciones web a la medida de tus necesidades.",
  "Plataformas": "Plataformas",
  "plataformas_desc": "Diseño, estructuro y desarrollo plataformas personalizadas para tu negocio.",
  "Ecommerce": "Ecommerce",
  "ecommerce_desc": "Elevo tu potencial en ventas por medio de e-Commerce con integración de pasarelas de pagos.",
  "cms": "cms",
  "CMS": "CMS",
  "cms_desc": "Desarrollo sitios rápidos con WordPress y Drupal, aplicando diferentes técnicas de seguridad.",
  "diseño web": "diseño web",
  "Diseño Web Efectivo": "Diseño Web Efectivo",
  "diseno_web_desc": "Realizo diseño web efectivo que genera impacto en tu marca.",
  "Consultoria": "Consultoria",
  "Consultoría UX/UI": "Consultoría UX/UI",
  "consultoria_desc": "Diseño y creo la interfaz que tu empresa necesita, segura y fácil de usar.",
  "Portafolio": "Portafolio",
  "visitar_texto": "Puedes visitar también la página de",
  "proyectos_texto": "donde encontraras más proyectos en los que he colaborado como desarrollador web.",
  "Ver sitio web": "Ver sitio web",
  "minestle_desc": "Sitio con artículos, recetas, promociones y podcast con filtro por país.",
  "nescafe_desc": "Desarrollo de sitio web para la edición especial Nescafé Huehuetenango.",
  "crypto_desc": "Landing con cuenta regresiva para evento de exposición de crypto monedas en Dubai.",
  "No disponible": "No disponible",
  "chappsy_desc": "Desarrollo de sitio web con activación de e-commerce al instante.",
  "viajegt_desc": "Directorio de empresas asociadas y blog para la Comisión de Turismo Sostenible de Agexport.",
  "agexport_desc": "Desarrollo de multisitio de Oferta Exportable de los sectores de Agexport Guatemala.",
  "checklist_desc": "Plataforma para llevar un checklist de colecciones de juguetes.",
  "medicenter_desc": "Sitio web autoadministrable con blog de noticias.",
  "Foto de perfil": "Foto de perfil",
  "acerca_descripcion_1": "Soy un desarrollador apasionado con más de 5 años de experiencia en la creación de aplicaciones web robustas y escalables. Me especializo en tecnologías como PHP, JavaScript, Laravel, Yii2, Vue.js y React.js, así como en la gestión de bases de datos con MySQL, PostgreSQL y la implementación de soluciones con WordPress y Drupal.",
  "acerca_descripcion_2": "Disfruto del desafío de explorar y dominar nuevas tecnologías para ampliar constantemente mis habilidades. Me encanta establecer metas desafiantes para superarme a mí mismo y encontrar soluciones creativas a los obstáculos que se presentan, comprometiéndome a contribuir con mi mejor esfuerzo en cada proyecto.",
  "Habilidades Técnicas": "Habilidades Técnicas",
  "Frontend": "Frontend",
  "Diseño Responsivo": "Diseño Responsivo",
  "Diseño Atómico": "Diseño Atómico",
  "Backend & Bases de Datos": "Backend & Bases de Datos",
  "CMS & Plataformas": "CMS & Plataformas",
  "Herramientas & Metodologías": "Herramientas & Metodologías",
  "Optimización": "Optimización",
  "Mantenibilidad": "Mantenibilidad",
  "Soporte en Producción": "Soporte en Producción",
  "Experiencia Profesional": "Experiencia Profesional",
  "Programador Full Stack": "Programador Full Stack",
  "ia2030_summary": "Responsable de la creación y mantenimiento de una plataforma de administración central para una compañía de sistemas en el sector de juegos y loterías, garantizando la fiabilidad, seguridad y usabilidad del sistema para usuarios internos.",
  "ia2030_resp_1_title": "Desarrollo y Mantenimiento de Funcionalidades:",
  "ia2030_resp_1_desc": "Diseñé, implementé y mantuve características críticas para múltiples proyectos web, asegurando la escalabilidad y estabilidad del sistema. Esto incluyó la configuración dinámica de productos y sorteos, y la creación de componentes reutilizables para optimizar el flujo de trabajo.",
  "ia2030_resp_2_title": "Optimización y Rendimiento:",
  "ia2030_resp_2_desc": "Optimicé la arquitectura del código, reduciendo la complejidad y mejorando la mantenibilidad para futuros desarrollos. Esto resultó en una mejora significativa en el rendimiento de la aplicación.",
  "ia2030_resp_3_title": "Liderazgo de Módulos:",
  "ia2030_resp_3_desc": "Dirigí la creación de módulos críticos para la plataforma de administración, gestionando el proyecto desde los requisitos iniciales hasta el despliegue en producción. Esto incluyó la colaboración estrecha con equipos de back-end y diseño.",
  "ia2030_resp_4_title": "Soporte y Depuración en Producción:",
  "ia2030_resp_4_desc": "Brindé soporte de producción de nivel 3, respondiendo a incidentes y depurando fallos en tiempo real para garantizar la continuidad del servicio y la satisfacción del cliente.",
  "ia2030_resp_5_title": "Manejo de Bases de Datos:",
  "ia2030_resp_5_desc": "Colaboré en la optimización de consultas a la base de datos para la edición de entidades y productos, evitando problemas de rendimiento y timeouts.",
  "Tecnologías principales utilizadas": "Tecnologías principales utilizadas",
  "Desarrollador Web Senior": "Desarrollador Web Senior",
  "weclick_senior_resp_1": "Lideré el ciclo completo de desarrollo para aplicaciones web y campañas de marketing digital para importantes clientes internacionales en Centro América y Uruguay.",
  "weclick_senior_resp_2": "Colaboré en equipos multidisciplinarios siguiendo metodologías ágiles para entregar proyectos dentro de los plazos establecidos.",
  "weclick_senior_resp_3": "Implementé soluciones técnicas que procesaron transacciones y gestionaron datos de usuarios de manera segura y eficiente.",
  "Proyectos Destacados": "Proyectos Destacados",
  "proyecto_borges_title": "Sistema de Promociones - Borges Centro América",
  "proyecto_borges_desc_1": "Desarrollé un sistema completo de gestión de promociones para productos alimenticios",
  "proyecto_borges_desc_2": "Implementé módulos de administración, validación de participantes y generación de reportes",
  "proyecto_borges_desc_3": "Optimicé el rendimiento para manejar picos de tráfico durante campañas promocionales",
  "proyecto_coors_title": "Sistema de Canjeo de Puntos - Coors Light Centro América",
  "proyecto_coors_desc_1": "Creé una plataforma de fidelización donde usuarios canjeaban puntos por premios",
  "proyecto_coors_desc_2": "Integré con sistemas de cupones y validación en puntos de venta",
  "proyecto_coors_desc_3": "Diseñé la arquitectura de base de datos para tracking de transacciones y puntos",
  "proyecto_agexport_title": "Ventanilla de Información - Agexport Guatemala",
  "proyecto_agexport_desc_1": "Desarrollé un sistema de gestión de información para exportadores",
  "proyecto_agexport_desc_2": "Implementé paneles administrativos y módulos de categorización de contenido",
  "proyecto_purina_title": "Sistema de Recomendación - Purina Centro América",
  "proyecto_purina_desc_1": "Creé un sistema interactivo para recomendar nombres de mascotas basado en características",
  "proyecto_purina_desc_2": "Implementé un algoritmo de matching que mejoró la experiencia de usuario",
  "Algoritmos": "Algoritmos",
  "proyecto_minestle_title": "Sitio Minestle - Nestlé Centro América",
  "proyecto_minestle_desc_1": "Desarrollé y personalicé un sitio corporativo utilizando Drupal",
  "proyecto_minestle_desc_2": "Implementé módulos personalizados y optimicé el rendimiento del sitio",
  "proyecto_ebeauty_title": "Campañas de Ebeauty Uruguay y Beauty Zone",
  "proyecto_ebeauty_desc_1": "Desarrollé múltiples plataformas de promociones y ofertas de productos para el mercado uruguayo y centroamericano",
  "proyecto_ebeauty_desc_2": "Implementé sistemas de registro, validación y seguimiento de participantes",
  "proyecto_ebeauty_desc_3": "Creé paneles de administración para el monitoreo en tiempo real de las campañas",
  "proyecto_nestle_title": "Landing Pages y Centros de Preferencia - Nestlé Centro América",
  "proyecto_nestle_desc_1": "Desarrollé landing pages para campañas específicas de productos Nescafé",
  "proyecto_nestle_desc_2": "Implementé centros de preferencia para segmentación de audiencia y marketing personalizado",
  "proyecto_nestle_desc_3": "Optimicé los sitios para máximo rendimiento y conversión",
  "Desarrollador Web": "Desarrollador Web",
  "weclick_junior_resp_1": "Participé en el desarrollo de aplicaciones web personalizadas para diversos clientes, principalmente en Guatemala.",
  "weclick_junior_resp_2": "Contribuí al ciclo completo de desarrollo desde el análisis de requerimientos hasta la implementación.",
  "weclick_junior_resp_3": "Mantuve y optimicé sistemas existentes mejorando su funcionalidad y rendimiento.",
  "proyecto_harley_title": "Sistema de Facturación - Harley Guatemala",
  "proyecto_harley_desc_1": "Desarrollé un sistema de registro de facturación y gestión de requerimientos de clientes",
  "proyecto_harley_desc_2": "Implementé módulos de generación de reportes y seguimiento de estados",
  "proyecto_harley_desc_3": "Automaticé procesos manuales mejorando la eficiencia operativa",
  "proyecto_escuela_title": "Sistema de Inscripción - Escuela La Asunción Guatemala",
  "proyecto_escuela_desc_1": "Creé una plataforma completa de inscripción en línea para alumnos",
  "proyecto_escuela_desc_2": "Implementé validaciones de datos y flujos de aprobación",
  "proyecto_escuela_desc_3": "Diseñé una interfaz amigable para usuarios con diferentes niveles de acceso",
  "proyecto_vupe_title": "Sitios Informativos - VUPE Guatemala y Agexport Guatemala",
  "proyecto_vupe_desc_1": "Desarrollé sitios web informativos con WordPress",
  "proyecto_vupe_desc_2": "Personalicé temas y plugins según los requerimientos específicos de cada cliente",
  "proyecto_vupe_desc_3": "Optimicé el SEO y la experiencia de usuario en todos los proyectos"
}